1

In [1]:
import mysql.connector

In [2]:
mydb = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='northwind')

mycursor = mydb.cursor()         
mycursor.execute("SHOW DATABASES")                     

for x in mycursor:
    print(x)

('BD_Alumna',)
('BD_pruebas',)
('Project_1',)
('creacion_tienda',)
('information_schema',)
('mysql',)
('northwind',)
('performance_schema',)
('project-da-promo-C-module-1-team-5',)
('sys',)
('tienda',)
('tienda_zapatillas',)

2

In [17]:
mydb = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='northwind')    
lista_tuplas = []
mycursor = mydb.cursor()         
mycursor.execute("SHOW TABLES")                     

for i in mycursor:
    lista_tuplas.append(i)

print(lista_tuplas)

[('categories',), ('customer_customer_demo',), ('customer_demographics',), ('customers',), ('employee_territories',), ('employees',), ('order_details',), ('orders',), ('products',), ('region',), ('shippers',), ('suppliers',), ('territories',)]

3

In [19]:
lista_tablas = []
for i in lista_tuplas:
    for n in i:
        lista_tablas.append(n)

In [20]:
lista_tablas

['categories',
 'customer_customer_demo',
 'customer_demographics',
 'customers',
 'employee_territories',
 'employees',
 'order_details',
 'orders',
 'products',
 'region',
 'shippers',
 'suppliers',
 'territories']

In [30]:
mydb = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='northwind')

lista_columnas = []
mycursor = mydb.cursor()  


for i in lista_tablas:

    mycursor.execute(f"SHOW COLUMNS FROM {i}") 

    for x in mycursor:
        print(x)

('category_id', b'int', 'NO', 'PRI', None, 'auto_increment')
('category_name', b'varchar(15)', 'NO', 'MUL', None, '')
('description', b'longtext', 'YES', '', None, '')
('picture', b'longblob', 'YES', '', None, '')
('customer_id', b'char(5)', 'NO', 'PRI', None, '')
('customertype_id', b'char(10)', 'NO', 'PRI', None, '')
('customer_type_id', b'char(10)', 'NO', 'PRI', None, '')
('customer_desc', b'longtext', 'YES', '', None, '')
('customer_id', b'char(5)', 'NO', 'PRI', None, '')
('company_name', b'varchar(40)', 'NO', 'MUL', None, '')
('contact_name', b'varchar(30)', 'YES', '', None, '')
('contact_title', b'varchar(30)', 'YES', '', None, '')
('address', b'varchar(60)', 'YES', '', None, '')
('city', b'varchar(15)', 'YES', 'MUL', None, '')
('region', b'varchar(15)', 'YES', 'MUL', None, '')
('postal_code', b'varchar(10)', 'YES', 'MUL', None, '')
('country', b'varchar(15)', 'YES', '', None, '')
('phone', b'varchar(24)', 'YES', '', None, '')
('fax', b'varchar(24)', 'YES', '', None, '')
('employee_id', b'int', 'NO', 'PRI', None, '')
('territory_id', b'varchar(20)', 'NO', 'PRI', None, '')
('employee_id', b'int', 'NO', 'PRI', None, 'auto_increment')
('last_name', b'varchar(20)', 'NO', 'MUL', None, '')
('first_name', b'varchar(10)', 'NO', '', None, '')
('title', b'varchar(30)', 'YES', '', None, '')
('title_of_courtesy', b'varchar(25)', 'YES', '', None, '')
('birth_date', b'datetime', 'YES', '', None, '')
('hire_date', b'datetime', 'YES', '', None, '')
('address', b'varchar(60)', 'YES', '', None, '')
('city', b'varchar(15)', 'YES', '', None, '')
('region', b'varchar(15)', 'YES', '', None, '')
('postal_code', b'varchar(10)', 'YES', 'MUL', None, '')
('country', b'varchar(15)', 'YES', '', None, '')
('home_phone', b'varchar(24)', 'YES', '', None, '')
('extension', b'varchar(4)', 'YES', '', None, '')
('photo', b'longblob', 'YES', '', None, '')
('notes', b'longtext', 'YES', '', None, '')
('reports_to', b'int', 'YES', 'MUL', None, '')
('photo_path', b'varchar(255)', 'YES', '', None, '')
('order_id', b'int', 'NO', 'PRI', None, '')
('product_id', b'int', 'NO', 'PRI', None, '')
('unit_price', b'double', 'NO', '', b'0', '')
('quantity', b'smallint', 'NO', '', b'0', '')
('discount', b'double', 'NO', '', b'0', '')
('order_id', b'int', 'NO', 'PRI', None, 'auto_increment')
('customer_id', b'char(5)', 'YES', 'MUL', None, '')
('employee_id', b'int', 'YES', 'MUL', None, '')
('order_date', b'datetime', 'YES', 'MUL', None, '')
('required_date', b'datetime', 'YES', '', None, '')
('shipped_date', b'datetime', 'YES', 'MUL', None, '')
('ship_via', b'int', 'YES', 'MUL', None, '')
('freight', b'double', 'YES', '', b'0', '')
('ship_name', b'varchar(40)', 'YES', '', None, '')
('ship_address', b'varchar(60)', 'YES', '', None, '')
('ship_city', b'varchar(15)', 'YES', '', None, '')
('ship_region', b'varchar(15)', 'YES', '', None, '')
('ship_postal_code', b'varchar(10)', 'YES', 'MUL', None, '')
('ship_country', b'varchar(15)', 'YES', '', None, '')
('product_id', b'int', 'NO', 'PRI', None, 'auto_increment')
('product_name', b'varchar(40)', 'NO', 'MUL', None, '')
('supplier_id', b'int', 'YES', 'MUL', None, '')
('category_id', b'int', 'YES', 'MUL', None, '')
('quantity_per_unit', b'varchar(20)', 'YES', '', None, '')
('unit_price', b'double', 'YES', '', b'0', '')
('units_in_stock', b'smallint', 'YES', '', b'0', '')
('units_on_order', b'smallint', 'YES', '', b'0', '')
('reorder_level', b'smallint', 'YES', '', b'0', '')
('discontinued', b'tinyint(1)', 'NO', '', b'0', '')
('region_id', b'int', 'NO', 'PRI', None, '')
('region_description', b'char(50)', 'NO', '', None, '')
('shipper_id', b'int', 'NO', 'PRI', None, 'auto_increment')
('company_name', b'varchar(40)', 'NO', '', None, '')
('phone', b'varchar(24)', 'YES', '', None, '')
('supplier_id', b'int', 'NO', 'PRI', None, 'auto_increment')
('company_name', b'varchar(40)', 'NO', 'MUL', None, '')
('contact_name', b'varchar(30)', 'YES', '', None, '')
('contact_title', b'varchar(30)', 'YES', '', None, '')
('adress', b'varchar(60)', 'YES', '', None, '')
('city', b'varchar(15)', 'YES', '', None, '')
('region', b'varchar(15)', 'YES', '', None, '')
('postal_code', b'varchar(10)', 'YES', 'MUL', None, '')
('country', b'varchar(15)', 'YES', '', None, '')
('phone', b'varchar(24)', 'YES', '', None, '')
('fax', b'varchar(24)', 'YES', '', None, '')
('home_page', b'longtext', 'YES', '', None, '')
('territory_id', b'varchar(20)', 'NO', 'PRI', None, '')
('territory_description', b'char(50)', 'NO', '', None, '')
('region_id', b'int', 'NO', 'MUL', None, '')

4. Realizad las siguientes queries:

- Extraed el primer pedido donde se ha gastado m√°s. Devolved el id del pedido y la cantidad gastada.

In [10]:
import pandas as pd

In [32]:
mydb = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='northwind')

sql = "SELECT order_id, (unit_price * quantity) FROM order_details ORDER BY (unit_price * quantity) DESC LIMIT 1"
                    
df = pd.read_sql_query(sql,mydb)

In [33]:
df.head()

   order_id  (unit_price * quantity)
0     10865                  15810.0

- Devuelve la misma query que en el anterior ejercicio, pero en este caso devuelve todos los resultados.

In [34]:
mydb = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='northwind')

sql = "SELECT order_id, (unit_price * quantity) FROM order_details ORDER BY (unit_price * quantity)"
                    
df = pd.read_sql_query(sql,mydb)

In [37]:
df

      order_id  (unit_price * quantity)
0        10462                      4.8
1        10281                      7.3
2        10420                      9.6
3        10850                     10.0
4        10782                     12.5
...        ...                      ...
2150     10353                  10540.0
2151     10417                  10540.0
2152     10889                  10540.0
2153     10865                  15810.0
2154     10981                  15810.0

[2155 rows x 2 columns]

- Extraed el n√∫meros de pedidos que se hayan hecho por dia. Devolved los resultados en una dataframe.

In [38]:
mydb = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='northwind')

sql = "SELECT COUNT(order_id), order_date FROM orders GROUP BY order_date"
                    
df = pd.read_sql_query(sql,mydb)

In [39]:
df.head()

   COUNT(order_id) order_date
0                1 1996-07-04
1                1 1996-07-05
2                2 1996-07-08
3                1 1996-07-09
4                1 1996-07-10

Extraed los pedidos hechos por Nancy Daviolo. Tendr√©is que hacer una subquery.

In [ ]:
mydb = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='northwind')

sql =

5. Para finalizar el ejercicio, desconectad la conexi√≥n con el servidor